validation/conventional/scalarTransport/RANS/3D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (9.08 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    crossflow
    {
        type            fixedValue;
        value           uniform (9.08 0 0);
    }
    jet
    {
        type            fixedValue;
        value           uniform (0 0 37.72);
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            noSlip;
    }
    back
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    pipe
    {
        type            noSlip;
    }
}

// ************************************************************************* //
