validation/conventional/scalarTransport/RANS/3D/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.02783;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    crossflow
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.015;
        value           $internalField;
    }
    jet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.07;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type	        kFunction;
        value           kValue;
    }
    back
    {
        type	        kFunction;
        value           kValue;
    }
    bottom
    {
        type	        kFunction;
        value           kValue;
    }
    top
    {
        type	        kFunction;
        value           kValue;
    }
    pipe
    {
        type	        kFunction;
        value           kValue;
    }
}

// ************************************************************************* //
